In [1]:
import pandas as pd 
import numpy as np

In [1]:
df=pd.read_csv("income.csv")

NameError: name 'pd' is not defined

In [ ]:
df

In [4]:
df=pd.read_csv("c:/1-maths/income.csv")

In [5]:
df

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000

In [6]:
df=pd.read_csv("c:/1-maths/income.csv",names=['name','income'])

In [7]:
df

        name              income
0       Name  Monthly Income ($)
1        Rob                5000
2      Rafiq                6000
3       Nina                4000
4      Sofia                7500
5      Mohan                8000
6        Tao                7000
7  Elon Musk            10000000

In [12]:
df=pd.read_csv("c:/1-maths/income.csv",names=['name','income'],skiprows=[0])

In [15]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [13]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [13]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [14]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [15]:
df.income[3]=np.NaN

C:\Users\Pradip\AppData\Local\Temp\ipykernel_4088\3455098566.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.income[3]=np.NaN

In [16]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [17]:
df.income.mean()

1671666.6666666667

In [18]:
df_new=df.fillna(df.income.mean()) #fillna - filling the null value

In [19]:
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [20]:
df_new=df.fillna(df.income.median()) #mean and median are first mediam of bussiness decisions

In [21]:
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [22]:
#when their is a outlier then and then use median imputation or else use mean value
#outlier is the value greater or smaller from others (indiffernet value)

In [23]:
df.income.quantile(0.25)

5250.0

In [24]:
df.income.quantile(0.75)

7750.0

In [26]:
df.income.quantile(0.50)

6500.0

In [27]:
df.income.quantile(0.99)

9500400.000000002

In [28]:
percentile_99=df.income.quantile(0.99)

In [29]:
percentile_99

9500400.000000002

In [32]:
df_no_outlier=df[df.income<=percentile_99]

In [33]:
df_no_outlier

    name  income
0    Rob  5000.0
1  Rafiq  6000.0
2   Nina  4000.0
4  Mohan  8000.0
5    Tao  7000.0

In [34]:
 #standard deviation and variations are second movements of bussiness decisions

In [ ]:
'''measures of centre 
   afftected by + - x /
   mode,median and mean
   
   measures of spread
   afftected by x /
   S.D and Var
'''